{"class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"name": "mixed2", "filters": 32, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 32, 32, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "mixed3", "filters": 32, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "valid", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "mixed4", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "mixed5"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "units": 32, "name": "dense_3", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "units": 7, "name": "dense_4", "kernel_regularizer": null}}], "backend": "tensorflow"}